# Most Frequent Values

In [1]:
import pandas as pd
df=pd.read_csv('../data/employees.csv')

In [2]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

## Most Frequent Values for each column
> Note that when more than one value is present, it is randomly selected

In [4]:
df.mode().iloc[0]

First Name                   Marilyn
Gender                        Female
Start Date                 1/26/2005
Last Login Time              1:35 PM
Salary                       86676.0
Bonus %                        8.999
Senior Management               True
Team                 Client Services
Name: 0, dtype: object

## Top 3 most frequent values for each columns

In [22]:
df.mode().iloc[:3]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Marilyn,Female,1/26/2005,1:35 PM,86676.0,8.999,True,Client Services
1,NaN,NaN,10/23/1995,NaN,91462.0,12.182,NaN,NaN
2,NaN,NaN,10/30/1994,NaN,121160.0,NaN,NaN,NaN

### Verify frequent values with value_counts() for each column

In [6]:
df['First Name'].value_counts().head()

Marilyn    11
Barbara    10
Jeremy     10
Todd       10
Steven      9
Name: First Name, dtype: int64

In [7]:
df['Gender'].value_counts().head()

Female    431
Male      424
Name: Gender, dtype: int64

In [10]:
df['Salary'].value_counts().head()

121160    2
145988    2
86676     2
147183    2
91462     2
Name: Salary, dtype: int64

In [11]:
df['Bonus %'].value_counts().head()

8.999     3
12.182    3
1.451     2
1.113     2
9.494     2
Name: Bonus %, dtype: int64

In [12]:
df['Senior Management'].value_counts().head()

True     468
False    465
Name: Senior Management, dtype: int64

In [13]:
df['Team'].value_counts().head()

Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Name: Team, dtype: int64

In [14]:
df[df['First Name']=='Marilyn']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
43,Marilyn,Female,12/7/1980,3:16 AM,73524,5.207,True,Marketing
124,Marilyn,Female,11/16/1983,8:29 AM,76078,2.401,True,Product
161,Marilyn,NaN,8/22/1999,9:09 AM,103386,11.451,False,Distribution
232,Marilyn,Female,4/4/1997,9:28 PM,147663,10.263,False,Human Resources
307,Marilyn,Female,9/26/1981,2:23 AM,86386,2.937,False,Distribution
368,Marilyn,Female,12/17/1982,12:10 PM,147183,8.748,False,Business Development
391,Marilyn,Female,8/15/1989,9:14 AM,140502,9.989,True,Sales
565,Marilyn,Female,8/9/2006,11:24 AM,87145,17.330,False,Human Resources
636,Marilyn,Female,7/2/1984,4:06 PM,92430,2.924,False,Engineering
888,Marilyn,Female,10/8/2007,12:32 AM,115149,11.934,True,Legal
916,Marilyn,Female,1/16/1996,7:18 AM,118369,7.696,True,Business Development